[
    {
        "JobTitle": "Senior WordPress Developer",
        "Description": "We are looking for a skilled 'WordPress Website Developer' with expertise in end-to-end development, deployment, and maintenance of dynamic websites. Join our innovative team and contribute to creating outstanding digital experiences. Key Responsibilities: 1. Website Development: Design, develop, and maintain responsive WordPress websites that align with business objectives and user needs. 2. Customization: Customize themes, plugins, and templates to meet specific project requirements. 3. Integration: Implement third-party APIs, payment gateways, CRM tools, and other integrations as needed. 4. Optimization: Ensure website performance, speed, and security are up to industry standards. 5. Deployment: Manage end-to-end deployment, including hosting, DNS configuration, and server management. 6. Troubleshooting: Debug and resolve technical issues promptly. 7. Collaboration: Work closely with designers, content creators, and other team members to deliver cohesive solutions. 8. Maintenance: Provide ongoing support, updates, and enhancements to existing websites. Required Skills & Qualifications: Technical Expertise: - Proficiency in WordPress, including custom theme and plugin development. - Strong knowledge of PHP, HTML5, CSS3, JavaScript, and MySQL. - Familiarity with modern frameworks like React, Vue.js, or Angular is a plus. Deployment Experience: - Hands-on experience with version control systems (e.g., Git). - Proficient in server setup, hosting environments, and DNS configuration. - Knowledge of CI/CD pipelines is advantageous. Problem-Solving: - Ability to identify, diagnose, and resolve performance bottlenecks and security issues. Soft Skills: - Strong communication and teamwork skills. - Excellent time management and ability to meet deadlines. Preferred Qualifications: - Experience with SEO, accessibility standards, and analytics integration. - Understanding of cloud services like AWS, Google Cloud, or Azure. Who can apply 1. Candidates with minimum 1 years of experience. 2. Those who are from or open to relocate to Greater Noida and neighboring cities Other requirements B.tech Experience with SEO, accessibility standards, and analytics integration. Understanding of cloud services like AWS, Google Cloud, or Azure. Salary Annual CTC: ₹ 5,00,000 - 6,00,000 /year",
        "Skills": [
            ""
        ],
        "Experience": [],
        "Salary": "0-0",
        "Location": "Unknown"
    },
    {
        "JobTitle": "Key responsibilities:",
        "Description": "1. Create visually appealing graphics for various platforms including websites, social media and print. 2. Collaborate with the marketing and content teams to develop design concepts and execute projects. 3. Use design tools such as Figma and Adobe Illustrator to produce high-quality designs. Who can apply 1. Candidates with minimum 1 years of experience. 2. Those who are from or open to relocate to Noida and neighboring cities Other requirements 1. Experience with other tools such as Adobe Photoshop and InDesign. 2. Basic understanding of web design principles and HTML/CSS 3. Ability to work collaboratively in a team environment. Salary Annual CTC: ₹ 2,00,000 - 3,00,000 /year Number of openings 5",
        "Experience": [
            "1"
        ],
        "Salary": "0-0",
        "Skills": [],
        "Location": "Unknown"
    },
    {
        "JobTitle": "As a Cinematographer at Bluntly Streaming, you will have the exciting opportunity to showcase your skills in video making, direction, video editing, Adobe Premiere Pro, photography, and Adobe Photoshop. Your creativity and technical expertise will play a crucial role in producing high-quality content for our streaming platform.",
        "Description": "Key responsibilities: 1. Collaborate with the content team to develop creative concepts and storyboards for video projects and direct it 2. Shoot and capture high-quality video footage using professional equipment and techniques. 3. Edit video footage to produce compelling and engaging content for our platform. 4. Utilize Adobe Premiere Pro and Adobe Photoshop to enhance video quality and visual appeal. 5. Ensure all video content meets brand standards and guidelines. 6. Stay up-to-date on industry trends and technologies to continuously improve our video production process. 7. Work closely with the post-production team to finalize and deliver completed projects on time. If you are passionate about cinematography and have a keen eye for detail, we want you to join our innovative team at Bluntly Streaming. Your talent and expertise will help us deliver exceptional content to our audience. Apply now to be a part of our dynamic team! Salary Probation: Duration: 1 month Salary during probation: ₹10,000 - 15,000 /month (only for freshers) After probation: Annual CTC: ₹ 2,00,000 - 3,00,000 /year Perks Informal dress code Free snacks & beverages Number of openings 2",
        "Salary": "₹10,000 - 15,000 /month (only for freshers)",
        "Skills": [],
        "Location": "Unknown",
        "Experience": [
            0
        ]
    },
    {
        "JobTitle": "Key responsibilities:",
        "Description": "1. Getting familiar with the underwriting criteria of our 15 partner banks, which include SBI, BOB, ICICI, Axis Bank, HDFC, etc. 2. Screen the education loan applications, advise students on the documentation, and coordinate with bank staff for smooth processing of the education loan. 3. Work on solving student's queries. 4. Manage the process from eligibility to the sanctioning of the loan. 5. This job requires you to be on calls for longer hours, as you will deal with students virtually. To summarize, this job consists of 20% Banking Finance, 40% Customer facing operations, 40% Business Development and Sales. Skill(s) required English Proficiency (Spoken) Who can apply 1. Those who are from or open to relocate to Kurnool, Visakhapatnam, Warangal, Secunderabad, Hyderabad, Uppal, Begumpet, Rai Durg, Amberpet, Srikakulam and neighboring cities Other requirements 1. Any graduate or postgraduate with different specializations from the 2023 & 2024 batches is good to go. 2. No prior experience is required or candidates with 1 year of work experience are also eligible. Salary Annual CTC: ₹ 4,00,000 - 4,30,000 /year Perks Informal dress code 5 days a week Free snacks & beverages Number of openings 20",
        "Salary": "0-0",
        "Skills": [],
        "Location": "Unknown",
        "Experience": [
            0
        ]
    },
    {
        "JobTitle": "About the job",
        "Description": "Key responsibilities: 1. Create clear, compelling, and well-researched content for various platforms, including websites, blogs, social media, email newsletters, and marketing materials. 2. Develop content strategies to meet business objectives, attract target audiences, and enhance brand voice. 3. Collaborate with marketing, design, and product teams to produce content that aligns with company goals. 4. Optimize content for SEO to increase organic traffic and improve search engine rankings. 5. Edit and proofread content to ensure clarity, consistency, and accuracy. 6. Stay updated on industry trends, competitor activities, and emerging content formats to keep content fresh and relevant. 7. Manage content calendars and meet deadlines while maintaining a high standard of quality. 8. Analyze performance metrics and adjust content strategies accordingly. Note: 1. Working says: Monday to Saturday. 2. Timings: 10 AM to 7 PM. 3. Work from the office: Monday, Wednesday and Friday. 4. Work from home: Tuesday, Thursday and Saturday 5. A laptop is a mandatory requirement for this position Skill(s) required Blogging Creative Writing Digital Marketing English Proficiency (Spoken) English Proficiency (Written) Search Engine Optimization (SEO) Social Media Marketing Salary Annual CTC: ₹ 2,00,000 - 4,00,000 /year Perks Informal dress code Free snacks & beverages Number of openings 1",
        "Salary": "0-0",
        "Skills": [],
        "Location": "Unknown",
        "Experience": [
            0
        ]
    }
]